「TALENT ARENA」をご利用いただきありがとうございます。

===================================
ご登録の手続きは完了していません

※ こちらは【チーム登録手続き処理】になります。選手として会員登録したい場合はこのメールを破棄してください。
===================================

下記のURLをクリックして、ご登録の手続きをお願いいたします。
{!! $url !!}

上記URLからのご登録のお手続きは、本メールが届いてから24時間有効です。
24時間経過後は仮登録が無効になりますので、会員登録をはじめからやり直してください。
……………………………………………
このメールにお心当たりの無い場合、恐れ入りますが本メールの破棄をお願いいたします。
このメールは送信専用アドレスから配信しております。
ご返信いただいてもご回答できませんのでご了承ください。

今後とも「TALENT ARENA」をよろしくお願いいたします。

--------------------------------
TALENT ARENA
https://hoge.jp/
--------------------------------
